src/cf/InformationRegisters/КонтрагентыНаМониторингеСПАРКРиски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КонтрагентыНаМониторингеСПАРКРиски</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Поставлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПостановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗапроса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Пользователь</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОшибки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОшибокСПАРКРиски</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтрагентБИП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РучноеДобавление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СвойстваКонтрагентовСПАРКРиски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СвойстваКонтрагентовСПАРКРиски</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННКорректный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвояОрганизация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтрагентБИП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СобытияМониторингаСПАРКРиски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СобытияМониторингаСПАРКРиски</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипСобытияИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаМониторинга</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НовоеЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтароеЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтрагентБИП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/ТипыСобытийСПАРКРиски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ТипыСобытийСПАРКРиски</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Название</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Критичное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/ИнтернетПоддержкаПользователейБП/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область СПАРК

Функция ЦветаСПАРК() Экспорт
	
	ЦветаСПАРК = Новый Структура;
	ЦветаСПАРК.Вставить("ВысокийРиск",			ЦветаСтиля.ЦветГрадацияСПАРКВысокийРиск);
	ЦветаСПАРК.Вставить("СреднийРиск",			ЦветаСтиля.ЦветГрадацияСПАРКСреднийРиск);
	ЦветаСПАРК.Вставить("НизкийРиск",			ЦветаСтиля.ЦветГрадацияСПАРКНизкийРиск);
	ЦветаСПАРК.Вставить("ПросроченныеДанные",	ЦветаСтиля.ПросроченныеДанныеЦвет);
	ЦветаСПАРК.Вставить("ОсобыйТекст",			ЦветаСтиля.ЦветОсобогоТекста);
	
	Возврат ЦветаСПАРК;
	
КонецФункции

Функция СобытияМониторинга() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтрагентыНаМониторингеСПАРКРиски.Контрагент КАК Контрагент,
	|	СвойстваКонтрагентовСПАРКРиски.СвояОрганизация КАК СвояОрганизация
	|ПОМЕСТИТЬ КонтрагентыДляМониторинга
	|ИЗ
	|	РегистрСведений.КонтрагентыНаМониторингеСПАРКРиски КАК КонтрагентыНаМониторингеСПАРКРиски
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваКонтрагентовСПАРКРиски КАК СвойстваКонтрагентовСПАРКРиски
	|		ПО КонтрагентыНаМониторингеСПАРКРиски.Контрагент = СвойстваКонтрагентовСПАРКРиски.Контрагент
	|ГДЕ
	|	СвойстваКонтрагентовСПАРКРиски.ИННКорректный
	|	И НЕ КонтрагентыНаМониторингеСПАРКРиски.Контрагент.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытияМониторингаСПАРКРиски.ДатаМониторинга КАК ДатаМониторинга,
	|	СобытияМониторингаСПАРКРиски.Контрагент,
	|	ТипыСобытийСПАРКРиски.Ссылка КАК Событие,
	|	СобытияМониторингаСПАРКРиски.НовоеЗначение КАК НовоеЗначение,
	|	СобытияМониторингаСПАРКРиски.СтароеЗначение КАК СтароеЗначение,
	|	КонтрагентыДляМониторинга.СвояОрганизация КАК СвояОрганизация,
	|	"""" КАК ИНН,
	|	ТипыСобытийСПАРКРиски.Критичное КАК КритичноеСобытие,
	|	ТипыСобытийСПАРКРиски.Название КАК НазваниеСобытия
	|ИЗ
	|	РегистрСведений.СобытияМониторингаСПАРКРиски КАК СобытияМониторингаСПАРКРиски
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТипыСобытийСПАРКРиски КАК ТипыСобытийСПАРКРиски
	|		ПО СобытияМониторингаСПАРКРиски.ТипСобытияИдентификатор = ТипыСобытийСПАРКРиски.Идентификатор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КонтрагентыДляМониторинга КАК КонтрагентыДляМониторинга
	|		ПО СобытияМониторингаСПАРКРиски.Контрагент = КонтрагентыДляМониторинга.Контрагент";
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаДанных;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработкаНовостей

// Возвращает значение варианта отбора по ленте новостей
// Подробнее в описании метода Справочник.Новости.ПолучитьСписокНовостей()
//
Функция ВариантОтбораПоЛентеНовостей() Экспорт
	
	Возврат 1;
	
КонецФункции

Функция КоличествоКонтекстныхНовостей() Экспорт
	
	Возврат 50;
	
КонецФункции

// Функция - возвращает ссылку на элемент справочника "Ленты новостей"
// 
// Возвращаемое значение:
//  СправочникСсылка.ЛентыНовостей - ссылка на справочник
//
Функция ЛентаНовостейЧтоНового() Экспорт
	
	Возврат ОбработкаНовостейПовтИсп.ПолучитьЛентуНовостейПоКоду("WhatIsNew");
	
КонецФункции

// Функция - Порядок контекстных новостей
// 
// Возвращаемое значение:
//  Строка - перечисление через запятую порядка сортировки новостей
//
Функция ПорядокКонтекстныхНовостей() Экспорт
	
	Возврат  "Прочтена Возр, ДатаПубликации Убыв, Важность Убыв";
	
КонецФункции

// Процедура - Снятие выделения элементов дерева
//
// Параметры:
//  СтрокаДерева - СтрокаДереваЗначений - строка дерева значений, с которого нужно снять пометку "Прочитано"
//
Процедура СнятиеВыделенияЭлементовДерева(СтрокаДерева) Экспорт
	
	СписокЭлементовДерева = СтрокаДерева.ПолучитьЭлементы();
	Для Каждого ЭлементДерева Из СписокЭлементовДерева Цикл
		
		ЭлементДерева.ВыделеннаяСтрока = Ложь;
		СнятиеВыделенияЭлементовДерева(ЭлементДерева);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
